'use strict';

module.exports = {
  1000: '未知错误',
  1001: '资源未找到',
  1002: '请求超时',
  1003: '权限不足',
  1004: '操作失败',
  1005: '尚未登录',

  1101: 'api token错误',

  2000: '消息模块未知错误',
  2001: '消息模块token错误',
  2002: '消息模块数据错误',
  2010: '消息模块拒绝寄方',
  2020: '消息模块拒绝收方',

  3000: '微信未知错误',
  3001: '微信签名错误',
  3002: '微信输入错误',
  3003: '微信AccToken错误',
  3010: '微信更新AccToken错误',
  3020: '微信更新JSSDK注入错误',
  3030: '微信oAuth未知错误',
  3031: '微信oAuth错误, code不合法',
  3080: '微信删除菜单错误',
  3081: '微信修改菜单错误',

  3100: '微信发送消息错误',

  4000: '微信二维码错误',
  4001: '微信二维码参数错误',
  4002: '微信二维码参数不足',
};
